src/cfe/osn/InformationRegisters/_СостоянияОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостоянияОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочтена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдаленаИзСпискаНовостей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвтоСбросНапоминанияПриПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСбросаВажности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/Enums/_РегламентныеЗаданияРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_РегламентныеЗаданияРасширения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбработкаПросроченныхЗаказовПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаФлагаПрочтенияНаСтарыеСообщения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/CommonModules/Кт_ОбщегоНазначенияСервер/Ext/Module.bsl
#Область ОформлениеДинамическогоСписка

Функция ДобавитьУсловноеОформление(ФормаОбъекта, ПараметрыОформления,Отбор) Экспорт
	
	ПолеОформления = СтрЗаменить(Отбор.ТЧ,"Объект.","");
	
	НовыйЭлемент = ФормаОбъекта.УсловноеОформление.Элементы.Добавить(); 
	Для Каждого Элемент Из ПараметрыОформления Цикл
		
		Если Элемент.Ключ="Поле" Тогда
			ПолеОформления = Элемент.Значение;
		Иначе
			НовыйЭлемент.Оформление.УстановитьЗначениеПараметра(Элемент.Ключ, Элемент.Значение);	
		КонецЕсли;	
		
	КонецЦикла;		
	НовыйЭлемент.Использование = Истина;
			
	ОформляемыеПоля = НовыйЭлемент.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
	
	ЭлементОтбор = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(Отбор.ТЧ+"."+Отбор.Поле);
	
	Если Отбор.Свойство("ВидСравнения") Тогда
		ЭлементОтбор.ВидСравнения  	= Отбор.ВидСравнения;
	Иначе	
		ЭлементОтбор.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ЭлементОтбор.ПравоеЗначение = Отбор.Значение;	
	
	Возврат Новый Структура("Элемент, Отбор", ФормаОбъекта.УсловноеОформление.Элементы.Количество()-1, НовыйЭлемент.Отбор.Элементы.Количество()-1);
	
КонецФункции

#КонецОбласти


			  
#Область ОбработкаРегламентныхЗадач

Процедура ВыполнитьРегламентнуюЗадачу( ИдентификаторКоманды ) Экспорт
	Если НЕ _РаботаСИнтерфейсомСервер.ИспользоватьСообщенияПользователям() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторКоманды = Перечисления._РегламентныеЗаданияРасширения.ОбработкаПросроченныхЗаказовПоставщику Тогда
		ОбработкаПросроченныхЗаказовПоставщику();
	ИначеЕсли ИдентификаторКоманды = Перечисления._РегламентныеЗаданияРасширения.УстановкаФлагаПрочтенияНаСтарыеСообщения Тогда
		УстановкаФлагаПрочтенияНаСтарыеСообщения();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаФлагаПрочтенияНаСтарыеСообщения()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_СостоянияОповещенияПользователей.ИдентификаторНовости КАК ИдентификаторНовости,
	               |	_СостоянияОповещенияПользователей.ДатаНачалаОповещения КАК ДатаНачалаОповещения,
	               |	_СостоянияОповещенияПользователей.ДатаЗавершения КАК ДатаЗавершения,
	               |	_СостоянияОповещенияПользователей.Прочтена КАК Прочтена,
	               |	_СостоянияОповещенияПользователей.Пользователь КАК Пользователь,
	               |	_СостоянияОповещенияПользователей.Наименование КАК Наименование,
	               |	_СостоянияОповещенияПользователей.Пометка КАК Пометка,
	               |	_СостоянияОповещенияПользователей.ОповещениеВключено КАК ОповещениеВключено,
	               |	_СостоянияОповещенияПользователей.УдаленаИзСпискаНовостей КАК УдаленаИзСпискаНовостей,
	               |	_СостоянияОповещенияПользователей.АвтоСбросНапоминанияПриПрочтении КАК АвтоСбросНапоминанияПриПрочтении,
	               |	_СостоянияОповещенияПользователей.Важность КАК Важность,
	               |	_СостоянияОповещенияПользователей.ДатаСбросаВажности КАК ДатаСбросаВажности,
	               |	_СостоянияОповещенияПользователей.Подзаголовок КАК Подзаголовок,
	               |	_СостоянияОповещенияПользователей.ТекстНовости КАК ТекстНовости,
	               |	_СостоянияОповещенияПользователей.ДополнительныеЗначения КАК ДополнительныеЗначения
	               |ИЗ
	               |	РегистрСведений._СостоянияОповещенияПользователей КАК _СостоянияОповещенияПользователей
	               |ГДЕ
	               |	_СостоянияОповещенияПользователей.Прочтена = ЛОЖЬ
	               |	И _СостоянияОповещенияПользователей.ДатаНачалаОповещения < &ДатаПроверки";
	
	ДатаПроверки = НачалоДня(ТекущаяДата() - (86400*30));
	
	Запрос.УстановитьПараметр("ДатаПроверки",ДатаПроверки);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений._СостоянияОповещенияПользователей.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторНовости     = Выборка.ИдентификаторНовости;
		Запись.Прочитать();
		
        ЗаполнитьЗначенияСвойств(Запись,Выборка);
		
		Запись.Прочтена             			= Истина;
		Запись.ОповещениеВключено   			= Ложь;
		Запись.ДатаЗавершения = ТекущаяДата();
		Запись.Записать(Истина);
	КонецЦикла;	
	
	
	
КонецПроцедуры

Процедура ОбработкаПросроченныхЗаказовПоставщику()
	
	ЗаказыПоставщику 		= _РаботаСИнтерфейсомСервер.НайтиПросроченныеЗаказы();
	
	Для Каждого СтрокаТаб Из ЗаказыПоставщику Цикл
		    Заказ = СтрокаТаб.Заказ;
		
			НаименованиеОповещения = _РаботаСИнтерфейсомСервер.СформироватьНаименованиеНовости(Строка(ТипЗнч(Заказ.Ссылка)),Заказ.Ссылка.Номер);
			ОповещениеПользователя = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения , Заказ.Ссылка.Автор); 
			
			ТекстНовости		= "Просрочено Поступление товаров по Заказу поставщику № " + 
							   	  Заказ.Ссылка.Номер + " от " + 
							      Формат(Заказ.Ссылка.Дата,"ДФ=""дд.ММ.гг 'г.'""") +
							      Символы.ПС + "Контрагент : " + СокрЛП(Заказ.Ссылка.Контрагент.Наименование);
								  
			
			_РаботаСИнтерфейсомСервер.СоздатьСообщениеПользователю(ОповещениеПользователя,НаименованиеОповещения, ТекстНовости, Заказ.Ссылка.Автор, Заказ.Ссылка,Заказ.Ссылка.Дата);
			_РаботаСИнтерфейсомСервер.СозданиеЗадачЗакупщикаЗаказПросрочен(Заказ.Ссылка);
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти			  
			  
#Область Обшие

Функция ИмяСобытияВЖурналеРегистрации()
	
	Возврат НСтр("ru = 'Дополнительные регламентные задания';
				|en = 'Дополнительные регламентные задания'");
	
КонецФункции

Процедура ЗаписатьВЖурналРегистрации(Уровень, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации(), Уровень,,, ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
